Revit 2026 API

# IFCAggregate Class

---

A collection of IFC handles or attributes.

SystemObject Autodesk.Revit.DB.IFCIFCAggregate

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCAggregate : IEnumerable<IFCData>,
	IDisposable
```
```vb
Public Class IFCAggregate
	Implements IEnumerable(Of IFCData), IDisposable
```
```cpp
public ref class IFCAggregate : IEnumerable<IFCData^>,
	IDisposable
```
```fsharp
type IFCAggregate =
    class
        interface IEnumerable<IFCData>
        interface IDisposable
    end
```

The IFCAggregate type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count | The number of the data values in the aggregate. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Item | Get the IFCData for this aggregate. |

|  | Name | Description |
| --- | --- | --- |
|  | Add | Adds an element to the aggregate. |
|  | AddAggregate | Creates a nested aggregate and adds it to the aggregate. |
|  | AddValueOfType | Adds an ifc object with primitive type of aggregate's item type to the aggregate. |
|  | Delete | Delete the aggregate object from the IFCFile model. |
|  | Dispose | Releases all resources used by the IFCAggregate |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetIFCAggregateIterator | Returns a IFCAggregateIterator that iterates through the collection. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB.IFC Namespace